pepijndevos/pybricks-micropython/bricks/esp32hub/boards/PYBRICKS_ESP32_S3/mpconfigboard.h
// SPDX-License-Identifier: MIT
// Copyright (c) 2025 The Pybricks Authors

// Board configuration for Pybricks ESP32-S3

#define MICROPY_HW_BOARD_NAME "Pybricks ESP32-S3"
#define MICROPY_HW_MCU_NAME "ESP32-S3"

// Enable USB CDC for serial communication
#define MICROPY_HW_ENABLE_USBDEV (1)
#define MICROPY_HW_USB_CDC (1)
